ITstreet1/STC89C52RC/ADC0809/adc0809.c
#include<reg52.h>
#include <intrins.h>  //use for _nop_()
#define UCHAR unsigned char
#define uint unsigned int
#define sint short int
#define FOSC 11059200

#define F500KHz    (65536-FOSC/4/500000)
sbit datain=P2;
sbit OE=P2^4;
sbit EOC=P2^5;

sbit START=P2^6;
sbit P2_0 = P2^0;
sbit P2_1 = P2^1;
sbit P2_3 = P2^3;
sbit P2_2 = P2^2;
sbit led2 = P1^1;
sbit led3 = P1^2;
sbit led4 = P1^3;
sbit led5 = P1^4;
sbit led6 = P1^6;
sbit led7 = P1^7;
float V_F;
int V;
UCHAR I_0,F_0,F_1;
sfr T2MOD = 0xc9;                   //timer2 mode register
unsigned char code table[]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,
                        0xf8,0x80,0x90};


void Delay500us()		//@11.0592MHz
{
	unsigned char i;

	_nop_();
	i = 227;
	while (--i);
}


void dprint(UCHAR num0,UCHAR num1,UCHAR num2,UCHAR num3){
//it works.
	P0=table[num0];
	P2_0=0;
	//Delay500us();
	P2_0=1;
	
	P0=(table[num1]& 0x7f);
	P2_1=0;
	//Delay500us();
	P2_1=1;
